In [29]:

import pandas as pd 
movies= pd.read_csv("C:\\Users\\hp\\Desktop\\dataset\\movies.csv")
import numpy as np

In [30]:
pd

In [6]:
#s1=pd.series (['drama','action','comedy','drama','action','action'])

In [5]:
#s1.value_counts()

In [ ]:
s1.str.upper()

In [ ]:
import matplotlib.pyplot

In [31]:
import pandas as pd

In [32]:
d=pd.DataFrame([9,3,4,5,6],columns=['col_1'])

In [33]:
d

   col_1
0      9
1      3
2      4
3      5
4      6

In [11]:
type(d)

pandas.core.frame.DataFrame

In [34]:
d.col_1.apply(lambda x:x+7)

0    16
1    10
2    11
3    12
4    13
Name: col_1, dtype: int64

In [35]:
d.col_1.values
#d.col_1.tolist

array([9, 3, 4, 5, 6], dtype=int64)

In [36]:
def add (x):
    if x%2==0:
        return x+7
    else:
        return x

In [37]:
d.col_1.apply(np.square)

0    81
1     9
2    16
3    25
4    36
Name: col_1, dtype: int64

In [38]:
d.col_1.apply(np.sqrt)

0    3.000000
1    1.732051
2    2.000000
3    2.236068
4    2.449490
Name: col_1, dtype: float64

In [13]:
f=d['col_1'].values

In [14]:
type(f)

numpy.ndarray

In [41]:
d.col_1.values

array([9, 3, 4, 5, 6], dtype=int64)

In [44]:
f=d['col_1']
type(f)

pandas.core.series.Series

In [54]:
d['col_2']=range(12,17)

In [55]:
d

   col_3  col_2
0     21     12
1     16     13
2     18     14
3     20     15
4     22     16

In [52]:
d.drop('col_1',axis=1,inplace=True)
d

   col_3
0     21
1     16
2     18
3     20
4     22

In [45]:
d['col_3']=d['col_1'].values+d['col_2'].values

In [46]:
d

   col_1  col_2  col_3
0      9     12     21
1      3     13     16
2      4     14     18
3      5     15     20
4      6     16     22